begin;

insert into public.leave_types (
  code,
  name
)
values
  ('0010', '事假'),
  ('0011', '病假'),
  ('0012', '婚假'),
  ('0013', '喪假'),
  ('0014', '公假'),
  ('0015', '公傷假'),
  ('0016', '產假'),
  ('0017', '特休假'),
  ('0018', '陪產(檢)假'),
  ('0019', '補休假'),
  ('0020', '產檢假'),
  ('0022', '無薪病假(時)'),
  ('0023', '彈性假'),
  ('0024', '特准半薪病假'),
  ('0026', '家庭照顧假'),
  ('0027', '半薪生理假'),
  ('0028', '全薪流產假'),
  ('0029', '半薪流產假'),
  ('0031', '無薪病假(天)'),
  ('0033', '特准事假'),
  ('0034', '刷卡遲到'),
  ('0035', '刷卡早退'),
  ('0036', '例假'),
  ('0038', '公傷假(天)'),
  ('0039', '曠職'),
  ('0040', '教育訓練假'),
  ('0041', '颱風豪雨假'),
  ('0042', '選舉假'),
  ('0043', '國定假日假'),
  ('0044', '颱風豪雨假(不扣薪)'),
  ('0045', '內部會議假'),
  ('0046', '原住民祭儀假'),
  ('0047', '休息日'),
  ('0048', '無薪生理假'),
  ('0049', '防疫假(有薪)'),
  ('0050', '防疫假(無薪)'),
  ('0051', '特別補休假'),
  ('0052', '遲到/早退(SK)'),
  ('0053', '婚假(天)(SK)'),
  ('0054', '公傷假(半薪)(時)(SK)'),
  ('0090', '系統使用的假'),
  ('0091', '家庭照顧假(扣事假用)'),
  ('0092', '半薪生理假(扣病假用)')
on conflict (code) do update
set
  name = excluded.name;

commit;
